-- ====================================================================
-- SP Name     : procExportTableSchemaAndInsertTable
-- Function    : 批次將各資料表匯出table schema，並複製一份到總表進行管理
-- Author      : Mark
-- Create Date : 2023-10-26
-- Parameter   : DBName
-- Modify His  : 
-- (1) 2023-10-26 : Mark    : CREATE 
-- ===================================================================

-- 如果stock資料庫不存在就建立一個新的
CREATE DATABASE IF NOT EXISTS stock DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci;
-- 使用stock資料庫
USE stock;
DELIMITER $$
-- 如果PROCEDURE存在就先移除                                                                                                                                                                   
DROP PROCEDURE IF EXISTS procExportTableSchemaAndInsertTable $$       
-- 建立PROCEDURE(傳入資料庫名稱參數)                                                                                                                           
CREATE PROCEDURE procExportTableSchemaAndInsertTable(DBName varchar(255))    
BEGIN   
		-- 變數宣告
			-- 1. 資料表集合名稱
			-- 2. 取得最後一張資料表
			-- 3. 時間戳記
        DECLARE table_name VARCHAR(255);                                                                                                                                        
        DECLARE end_of_tables INT DEFAULT 0;
        DECLARE mylocaltimestamp DATETIME;
		
        -- 利用SQL取出指定資料庫裡面所有資料表的list，直到最後一張資料表為止
        DECLARE cur CURSOR FOR                                                                                                                                                  
            SELECT t.table_name                                                                                                                                                 
            FROM information_schema.tables t                                                                                                                                    
            WHERE t.table_schema = DBName AND t.table_type='BASE TABLE' AND t.table_name <> 'stock_all_data';                                                                                                 
        DECLARE CONTINUE HANDLER FOR NOT FOUND SET end_of_tables = 1;   
        
		-- 開始建立6張資料表
		DROP TABLE IF EXISTS stock_daily;
		CREATE TABLE IF NOT EXISTS stock_daily
		(
			sdate varchar(10),
			id varchar(10),
			sname varchar(255),
			trs_qty decimal(18, 0),
			trs_count decimal(18, 0),
			trs_amt decimal(18, 0),
			open_price decimal(18, 2),
			h_price decimal(18, 2),
			l_price decimal(18, 2),
			close_price decimal(18, 2),
			s_status varchar(255),
			dec_price decimal(18, 2),
			lb_price decimal(18, 2),
			lb_amt decimal(18, 2),
			ls_price decimal(18, 2),
			ls_amt decimal(18, 2),
			PE decimal(18, 2)
		);
        
		DROP TABLE IF EXISTS stock_list;
		CREATE TABLE IF NOT EXISTS stock_list
		(
			id varchar(10),
			sname varchar(255),
			stock_attr varchar(255),
			industry varchar(255),
			CONSTRAINT PK_stock_list
				PRIMARY KEY (id)
		);

		DROP TABLE IF EXISTS stock_monthly_revenue;
		CREATE TABLE IF NOT EXISTS stock_monthly_revenue
		(
			yyyymm varchar(6),
			id varchar(10),
			sname varchar(255),
			month_amt decimal(18, 0),
			pre_m_amt decimal(18, 0),
			pre_y_amt decimal(18, 0),
			pre_m_percent decimal(18, 2),
			pre_y_percent decimal(18, 2),
			sum_amt decimal(18, 0),
			per_sum_amt decimal(18, 0),
			sum_percent decimal(18, 2),
			memo_str varchar(255),
			CONSTRAINT PK_stock_monthly_revenue
				PRIMARY KEY
				(
					id,
					yyyymm
				)
		);

		DROP TABLE IF EXISTS stock_daily_3;
		CREATE TABLE IF NOT EXISTS stock_daily_3
		(
			sdate varchar(10),
			id varchar(10),
			f_qty decimal(18, 0),
			i_qty decimal(18, 0),
			s_qty decimal(18, 0),
			t_qty decimal(18, 0),
			est_f_qty decimal(18, 0),
			est_i_qty decimal(18, 0),
			est_s_qty decimal(18, 0),
			est_t_qty decimal(18, 0),
			trs_f_percent decimal(18, 2),
			trs_3_percent decimal(18, 2),
			CONSTRAINT PK_stock_daily_3
				PRIMARY KEY
				(
					id,
					sdate
				)
		);

		DROP TABLE IF EXISTS stock_daily_MT;
		CREATE TABLE IF NOT EXISTS stock_daily_MT
		(
			sdate varchar(10),
			id varchar(10),
			mt_b_qty decimal(18, 0),
			mt_s_qty decimal(18, 0),
			mt_r_qty decimal(18, 0),
			mt_qty decimal(18, 0),
			mt_dec_qty decimal(18, 0),
			mt_limit_qty decimal(18, 0),
			mt_use_percent decimal(18, 2),
			ss_b_qty decimal(18, 0),
			ss_s_qt decimal(18, 0),
			ss_r_qty decimal(18, 0),
			ss_qty decimal(18, 0),
			ss_dec_qty decimal(18, 0),
			ms_percent decimal(18, 2),
			ms_dec_qty decimal(18, 0),
			CONSTRAINT PK_stock_daily_MT
				PRIMARY KEY
				(
					id,
					sdate
				)
		);

		DROP TABLE IF EXISTS stock_daily_MR;
		CREATE TABLE IF NOT EXISTS stock_daily_MR
		(
			sdate varchar(10),
			id varchar(50),
			id_sub varchar(50),
			id_mr varchar(50),
			mrname varchar(255),
			b_qty decimal(18, 0),
			s_qty decimal(18, 0),
			dec_qty decimal(18, 0),
			dstatus int,
			trs_percent decimal(18, 2),
			CONSTRAINT PK_stock_daily_MR
				PRIMARY KEY
				(
					id,
					sdate
				)
		);
        
            -- 這邊開始建立stock_list資料集
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('1101','台泥','上市','水泥工業'),
			 ('1102','亞泥','上市','水泥工業'),
			 ('1103','嘉泥','上市','水泥工業'),
			 ('1104','環泥','上市','水泥工業'),
			 ('1108','幸福','上市','水泥工業'),
			 ('1109','信大','上市','水泥工業'),
			 ('1110','東泥','上市','水泥工業'),
			 ('1201','味全','上市','食品工業'),
			 ('1203','味王','上市','食品工業'),
			 ('1210','大成','上市','食品工業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('1213','大飲','上市','食品工業'),
			 ('1215','卜蜂','上市','食品工業'),
			 ('1216','統一','上市','食品工業'),
			 ('1217','愛之味','上市','食品工業'),
			 ('1218','泰山','上市','食品工業'),
			 ('1219','福壽','上市','食品工業'),
			 ('1220','台榮','上市','食品工業'),
			 ('1225','福懋油','上市','食品工業'),
			 ('1227','佳格','上市','食品工業'),
			 ('1229','聯華','上市','食品工業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('1231','聯華食','上市','食品工業'),
			 ('1232','大統益','上市','食品工業'),
			 ('1233','天仁','上市','食品工業'),
			 ('1234','黑松','上市','食品工業'),
			 ('1235','興泰','上市','食品工業'),
			 ('1236','宏亞','上市','食品工業'),
			 ('1256','鮮活果汁-KY','上市','食品工業'),
			 ('1301','台塑','上市','塑膠工業'),
			 ('1303','南亞','上市','塑膠工業'),
			 ('1304','台聚','上市','塑膠工業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('1305','華夏','上市','塑膠工業'),
			 ('1307','三芳','上市','塑膠工業'),
			 ('1308','亞聚','上市','塑膠工業'),
			 ('1309','台達化','上市','塑膠工業'),
			 ('1310','台苯','上市','塑膠工業'),
			 ('1312','國喬','上市','塑膠工業'),
			 ('1313','聯成','上市','塑膠工業'),
			 ('1314','中石化','上市','塑膠工業'),
			 ('1315','達新','上市','塑膠工業'),
			 ('1316','上曜','上市','建材營造業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('1319','東陽','上市','汽車工業'),
			 ('1321','大洋','上市','塑膠工業'),
			 ('1323','永裕','上市','塑膠工業'),
			 ('1324','地球','上市','塑膠工業'),
			 ('1325','恆大','上市','塑膠工業'),
			 ('1326','台化','上市','塑膠工業'),
			 ('1337','再生-KY','上市','塑膠工業'),
			 ('1338','廣華-KY','上市','汽車工業'),
			 ('1339','昭輝','上市','汽車工業'),
			 ('1340','勝悅-KY','上市','塑膠工業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('1341','富林-KY','上市','塑膠工業'),
			 ('1342','八貫','上市','其他業'),
			 ('1402','遠東新','上市','紡織纖維'),
			 ('1409','新纖','上市','紡織纖維'),
			 ('1410','南染','上市','紡織纖維'),
			 ('1413','宏洲','上市','紡織纖維'),
			 ('1414','東和','上市','紡織纖維'),
			 ('1416','廣豐','上市','其他業'),
			 ('1417','嘉裕','上市','紡織纖維'),
			 ('1418','東華','上市','紡織纖維');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('1419','新紡','上市','紡織纖維'),
			 ('1423','利華','上市','紡織纖維'),
			 ('1432','大魯閣','上市','貿易百貨業'),
			 ('1434','福懋','上市','紡織纖維'),
			 ('1435','中福','上市','其他業'),
			 ('1436','華友聯','上市','建材營造業'),
			 ('1437','勤益控','上市','其他業'),
			 ('1438','三地開發','上市','建材營造業'),
			 ('1439','雋揚','上市','紡織纖維'),
			 ('1440','南紡','上市','紡織纖維');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('1441','大東','上市','紡織纖維'),
			 ('1442','名軒','上市','建材營造業'),
			 ('1443','立益物流','上市','其他業'),
			 ('1444','力麗','上市','紡織纖維'),
			 ('1445','大宇','上市','紡織纖維'),
			 ('1446','宏和','上市','紡織纖維'),
			 ('1447','力鵬','上市','紡織纖維'),
			 ('1449','佳和','上市','紡織纖維'),
			 ('1451','年興','上市','紡織纖維'),
			 ('1452','宏益','上市','紡織纖維');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('1453','大將','上市','建材營造業'),
			 ('1454','台富','上市','紡織纖維'),
			 ('1455','集盛','上市','紡織纖維'),
			 ('1456','怡華','上市','建材營造業'),
			 ('1457','宜進','上市','紡織纖維'),
			 ('1459','聯發','上市','紡織纖維'),
			 ('1460','宏遠','上市','紡織纖維'),
			 ('1463','強盛','上市','紡織纖維'),
			 ('1464','得力','上市','紡織纖維'),
			 ('1465','偉全','上市','紡織纖維');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('1466','聚隆','上市','紡織纖維'),
			 ('1467','南緯','上市','紡織纖維'),
			 ('1468','昶和','上市','紡織纖維'),
			 ('1470','大統新創','上市','紡織纖維'),
			 ('1471','首利','上市','電子零組件業'),
			 ('1472','三洋實業','上市','紡織纖維'),
			 ('1473','台南','上市','紡織纖維'),
			 ('1474','弘裕','上市','紡織纖維'),
			 ('1475','業旺','上市','紡織纖維'),
			 ('1476','儒鴻','上市','紡織纖維');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('1477','聚陽','上市','紡織纖維'),
			 ('1503','士電','上市','電機機械'),
			 ('1504','東元','上市','電機機械'),
			 ('1506','正道','上市','電機機械'),
			 ('1512','瑞利','上市','汽車工業'),
			 ('1513','中興電','上市','電機機械'),
			 ('1514','亞力','上市','電機機械'),
			 ('1515','力山','上市','電機機械'),
			 ('1516','川飛','上市','其他業'),
			 ('1517','利奇','上市','電機機械');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('1519','華城','上市','電機機械'),
			 ('1521','大億','上市','汽車工業'),
			 ('1522','堤維西','上市','汽車工業'),
			 ('1524','耿鼎','上市','汽車工業'),
			 ('1525','江申','上市','汽車工業'),
			 ('1526','日馳','上市','電機機械'),
			 ('1527','鑽全','上市','電機機械'),
			 ('1528','恩德','上市','電機機械'),
			 ('1529','樂事綠能','上市','電機機械'),
			 ('1530','亞崴','上市','電機機械');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('1531','高林股','上市','電機機械'),
			 ('1532','勤美','上市','電機機械'),
			 ('1533','車王電','上市','汽車工業'),
			 ('1535','中宇','上市','電機機械'),
			 ('1536','和大','上市','汽車工業'),
			 ('1537','廣隆','上市','電機機械'),
			 ('1538','正峰','上市','電機機械'),
			 ('1539','巨庭','上市','電機機械'),
			 ('1540','喬福','上市','電機機械'),
			 ('1541','錩泰','上市','電機機械');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('1558','伸興','上市','電機機械'),
			 ('1560','中砂','上市','電機機械'),
			 ('1568','倉佑','上市','汽車工業'),
			 ('1582','信錦','上市','電子零組件業'),
			 ('1583','程泰','上市','電機機械'),
			 ('1587','吉茂','上市','汽車工業'),
			 ('1589','永冠-KY','上市','電機機械'),
			 ('1590','亞德客-KY','上市','電機機械'),
			 ('1597','直得','上市','電機機械'),
			 ('1598','岱宇','上市','生技醫療業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('1603','華電','上市','電器電纜'),
			 ('1604','聲寶','上市','電器電纜'),
			 ('1605','華新','上市','電器電纜'),
			 ('1608','華榮','上市','電器電纜'),
			 ('1609','大亞','上市','電器電纜'),
			 ('1611','中電','上市','電器電纜'),
			 ('1612','宏泰','上市','電器電纜'),
			 ('1614','三洋電','上市','電器電纜'),
			 ('1615','大山','上市','電器電纜'),
			 ('1616','億泰','上市','電器電纜');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('1617','榮星','上市','電器電纜'),
			 ('1618','合機','上市','電器電纜'),
			 ('1626','艾美特-KY','上市','電器電纜'),
			 ('1701','中化','上市','生技醫療業'),
			 ('1702','南僑','上市','食品工業'),
			 ('1707','葡萄王','上市','生技醫療業'),
			 ('1708','東鹼','上市','化學工業'),
			 ('1709','和益','上市','化學工業'),
			 ('1710','東聯','上市','化學工業'),
			 ('1711','永光','上市','化學工業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('1712','興農','上市','化學工業'),
			 ('1713','國化','上市','化學工業'),
			 ('1714','和桐','上市','化學工業'),
			 ('1717','長興','上市','化學工業'),
			 ('1718','中纖','上市','化學工業'),
			 ('1720','生達','上市','生技醫療業'),
			 ('1721','三晃','上市','化學工業'),
			 ('1722','台肥','上市','化學工業'),
			 ('1723','中碳','上市','化學工業'),
			 ('1725','元禎','上市','化學工業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('1726','永記','上市','化學工業'),
			 ('1727','中華化','上市','化學工業'),
			 ('1730','花仙子','上市','化學工業'),
			 ('1731','美吾華','上市','生技醫療業'),
			 ('1732','毛寶','上市','化學工業'),
			 ('1733','五鼎','上市','生技醫療業'),
			 ('1734','杏輝','上市','生技醫療業'),
			 ('1735','日勝化','上市','化學工業'),
			 ('1736','喬山','上市','生技醫療業'),
			 ('1737','臺鹽','上市','食品工業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('1752','南光','上市','生技醫療業'),
			 ('1760','寶齡富錦','上市','生技醫療業'),
			 ('1762','中化生','上市','生技醫療業'),
			 ('1773','勝一','上市','化學工業'),
			 ('1776','展宇','上市','化學工業'),
			 ('1783','和康生','上市','生技醫療業'),
			 ('1786','科妍','上市','生技醫療業'),
			 ('1789','神隆','上市','生技醫療業'),
			 ('1795','美時','上市','生技醫療業'),
			 ('1802','台玻','上市','玻璃陶瓷');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('1805','寶徠','上市','建材營造業'),
			 ('1806','冠軍','上市','玻璃陶瓷'),
			 ('1808','潤隆','上市','建材營造業'),
			 ('1809','中釉','上市','玻璃陶瓷'),
			 ('1810','和成','上市','玻璃陶瓷'),
			 ('1817','凱撒衛','上市','玻璃陶瓷'),
			 ('1903','士紙','上市','造紙工業'),
			 ('1904','正隆','上市','造紙工業'),
			 ('1905','華紙','上市','造紙工業'),
			 ('1906','寶隆','上市','造紙工業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('1907','永豐餘','上市','造紙工業'),
			 ('1909','榮成','上市','造紙工業'),
			 ('2002','中鋼','上市','鋼鐵工業'),
			 ('2006','東和鋼鐵','上市','鋼鐵工業'),
			 ('2007','燁興','上市','鋼鐵工業'),
			 ('2008','高興昌','上市','鋼鐵工業'),
			 ('2009','第一銅','上市','鋼鐵工業'),
			 ('2010','春源','上市','鋼鐵工業'),
			 ('2012','春雨','上市','鋼鐵工業'),
			 ('2013','中鋼構','上市','鋼鐵工業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('2014','中鴻','上市','鋼鐵工業'),
			 ('2015','豐興','上市','鋼鐵工業'),
			 ('2017','官田鋼','上市','鋼鐵工業'),
			 ('2020','美亞','上市','鋼鐵工業'),
			 ('2022','聚亨','上市','鋼鐵工業'),
			 ('2023','燁輝','上市','鋼鐵工業'),
			 ('2024','志聯','上市','鋼鐵工業'),
			 ('2025','千興','上市','鋼鐵工業'),
			 ('2027','大成鋼','上市','鋼鐵工業'),
			 ('2028','威致','上市','鋼鐵工業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('2029','盛餘','上市','鋼鐵工業'),
			 ('2030','彰源','上市','鋼鐵工業'),
			 ('2031','新光鋼','上市','鋼鐵工業'),
			 ('2032','新鋼','上市','鋼鐵工業'),
			 ('2033','佳大','上市','鋼鐵工業'),
			 ('2034','允強','上市','鋼鐵工業'),
			 ('2038','海光','上市','鋼鐵工業'),
			 ('2049','上銀','上市','電機機械'),
			 ('2059','川湖','上市','電子零組件業'),
			 ('2062','橋椿','上市','其他業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('2069','運錩','上市','鋼鐵工業'),
			 ('2101','南港','上市','橡膠工業'),
			 ('2102','泰豐','上市','橡膠工業'),
			 ('2103','台橡','上市','橡膠工業'),
			 ('2104','國際中橡','上市','橡膠工業'),
			 ('2105','正新','上市','橡膠工業'),
			 ('2106','建大','上市','橡膠工業'),
			 ('2107','厚生','上市','橡膠工業'),
			 ('2108','南帝','上市','橡膠工業'),
			 ('2109','華豐','上市','橡膠工業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('2114','鑫永銓','上市','橡膠工業'),
			 ('2115','六暉-KY','上市','汽車工業'),
			 ('2201','裕隆','上市','汽車工業'),
			 ('2204','中華','上市','汽車工業'),
			 ('2206','三陽工業','上市','汽車工業'),
			 ('2207','和泰車','上市','汽車工業'),
			 ('2208','台船','上市','航運業'),
			 ('2211','長榮鋼','上市','鋼鐵工業'),
			 ('2227','裕日車','上市','汽車工業'),
			 ('2228','劍麟','上市','汽車工業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('2231','為升','上市','汽車工業'),
			 ('2233','宇隆','上市','汽車工業'),
			 ('2236','百達-KY','上市','汽車工業'),
			 ('2239','英利-KY','上市','汽車工業'),
			 ('2241','艾姆勒','上市','汽車工業'),
			 ('2243','宏旭-KY','上市','汽車工業'),
			 ('2247','汎德永業','上市','汽車工業'),
			 ('2250','IKKA-KY','上市','汽車工業'),
			 ('2301','光寶科','上市','電腦及週邊設備業'),
			 ('2302','麗正','上市','半導體業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('2303','聯電','上市','半導體業'),
			 ('2305','全友','上市','電腦及週邊設備業'),
			 ('2308','台達電','上市','電子零組件業'),
			 ('2312','金寶','上市','其他電子業'),
			 ('2313','華通','上市','電子零組件業'),
			 ('2314','台揚','上市','通信網路業'),
			 ('2316','楠梓電','上市','電子零組件業'),
			 ('2317','鴻海','上市','其他電子業'),
			 ('2321','東訊','上市','通信網路業'),
			 ('2323','中環','上市','光電業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('2324','仁寶','上市','電腦及週邊設備業'),
			 ('2327','國巨','上市','電子零組件業'),
			 ('2328','廣宇','上市','電子零組件業'),
			 ('2329','華泰','上市','半導體業'),
			 ('2330','台積電','上市','半導體業'),
			 ('2331','精英','上市','電腦及週邊設備業'),
			 ('2332','友訊','上市','通信網路業'),
			 ('2337','旺宏','上市','半導體業'),
			 ('2338','光罩','上市','半導體業'),
			 ('2340','台亞','上市','半導體業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('2342','茂矽','上市','半導體業'),
			 ('2344','華邦電','上市','半導體業'),
			 ('2345','智邦','上市','通信網路業'),
			 ('2347','聯強','上市','電子通路業'),
			 ('2348','海悅','上市','其他業'),
			 ('2349','錸德','上市','光電業'),
			 ('2351','順德','上市','半導體業'),
			 ('2352','佳世達','上市','電腦及週邊設備業'),
			 ('2353','宏碁','上市','電腦及週邊設備業'),
			 ('2354','鴻準','上市','其他電子業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('2355','敬鵬','上市','電子零組件業'),
			 ('2356','英業達','上市','電腦及週邊設備業'),
			 ('2357','華碩','上市','電腦及週邊設備業'),
			 ('2358','廷鑫','上市','其他業'),
			 ('2359','所羅門','上市','其他電子業'),
			 ('2360','致茂','上市','其他電子業'),
			 ('2362','藍天','上市','電腦及週邊設備業'),
			 ('2363','矽統','上市','半導體業'),
			 ('2364','倫飛','上市','電腦及週邊設備業'),
			 ('2365','昆盈','上市','電腦及週邊設備業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('2367','燿華','上市','電子零組件業'),
			 ('2368','金像電','上市','電子零組件業'),
			 ('2369','菱生','上市','半導體業'),
			 ('2371','大同','上市','電機機械'),
			 ('2373','震旦行','上市','其他電子業'),
			 ('2374','佳能','上市','光電業'),
			 ('2375','凱美','上市','電子零組件業'),
			 ('2376','技嘉','上市','電腦及週邊設備業'),
			 ('2377','微星','上市','電腦及週邊設備業'),
			 ('2379','瑞昱','上市','半導體業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('2380','虹光','上市','電腦及週邊設備業'),
			 ('2382','廣達','上市','電腦及週邊設備業'),
			 ('2383','台光電','上市','電子零組件業'),
			 ('2385','群光','上市','電子零組件業'),
			 ('2387','精元','上市','電腦及週邊設備業'),
			 ('2388','威盛','上市','半導體業'),
			 ('2390','云辰','上市','其他電子業'),
			 ('2392','正崴','上市','電子零組件業'),
			 ('2393','億光','上市','光電業'),
			 ('2395','研華','上市','電腦及週邊設備業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('2397','友通','上市','電腦及週邊設備業'),
			 ('2399','映泰','上市','電腦及週邊設備業'),
			 ('2401','凌陽','上市','半導體業'),
			 ('2402','毅嘉','上市','電子零組件業'),
			 ('2404','漢唐','上市','其他電子業'),
			 ('2405','輔信','上市','電腦及週邊設備業'),
			 ('2406','國碩','上市','光電業'),
			 ('2408','南亞科','上市','半導體業'),
			 ('2409','友達','上市','光電業'),
			 ('2412','中華電','上市','通信網路業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('2413','環科','上市','電子零組件業'),
			 ('2414','精技','上市','電子通路業'),
			 ('2415','錩新','上市','電子零組件業'),
			 ('2417','圓剛','上市','電腦及週邊設備業'),
			 ('2419','仲琦','上市','通信網路業'),
			 ('2420','新巨','上市','電子零組件業'),
			 ('2421','建準','上市','電子零組件業'),
			 ('2423','固緯','上市','其他電子業'),
			 ('2424','隴華','上市','電腦及週邊設備業'),
			 ('2425','承啟','上市','電腦及週邊設備業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('2426','鼎元','上市','光電業'),
			 ('2427','三商電','上市','資訊服務業'),
			 ('2428','興勤','上市','電子零組件業'),
			 ('2429','銘旺科','上市','光電業'),
			 ('2430','燦坤','上市','電子通路業'),
			 ('2431','聯昌','上市','電子零組件業'),
			 ('2433','互盛電','上市','其他電子業'),
			 ('2434','統懋','上市','半導體業'),
			 ('2436','偉詮電','上市','半導體業'),
			 ('2438','翔耀','上市','光電業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('2439','美律','上市','通信網路業'),
			 ('2440','太空梭','上市','電子零組件業'),
			 ('2441','超豐','上市','半導體業'),
			 ('2442','新美齊','上市','電腦及週邊設備業'),
			 ('2443','昶虹','上市','其他業'),
			 ('2444','兆勁','上市','通信網路業'),
			 ('2449','京元電子','上市','半導體業'),
			 ('2450','神腦','上市','通信網路業'),
			 ('2451','創見','上市','半導體業'),
			 ('2453','凌群','上市','資訊服務業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('2454','聯發科','上市','半導體業'),
			 ('2455','全新','上市','通信網路業'),
			 ('2457','飛宏','上市','電子零組件業'),
			 ('2458','義隆','上市','半導體業'),
			 ('2459','敦吉','上市','其他電子業'),
			 ('2460','建通','上市','電子零組件業'),
			 ('2461','光群雷','上市','其他電子業'),
			 ('2462','良得電','上市','電子零組件業'),
			 ('2464','盟立','上市','其他電子業'),
			 ('2465','麗臺','上市','電腦及週邊設備業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('2466','冠西電','上市','光電業'),
			 ('2467','志聖','上市','電子零組件業'),
			 ('2468','華經','上市','資訊服務業'),
			 ('2471','資通','上市','資訊服務業'),
			 ('2472','立隆電','上市','電子零組件業'),
			 ('2474','可成','上市','其他電子業'),
			 ('2476','鉅祥','上市','電子零組件業'),
			 ('2477','美隆電','上市','其他電子業'),
			 ('2478','大毅','上市','電子零組件業'),
			 ('2480','敦陽科','上市','資訊服務業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('2481','強茂','上市','半導體業'),
			 ('2482','連宇','上市','其他電子業'),
			 ('2483','百容','上市','電子零組件業'),
			 ('2484','希華','上市','電子零組件業'),
			 ('2485','兆赫','上市','通信網路業'),
			 ('2486','一詮','上市','光電業'),
			 ('2488','漢平','上市','其他電子業'),
			 ('2489','瑞軒','上市','光電業'),
			 ('2491','吉祥全','上市','光電業'),
			 ('2492','華新科','上市','電子零組件業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('2493','揚博','上市','電子零組件業'),
			 ('2495','普安','上市','電腦及週邊設備業'),
			 ('2496','卓越','上市','其他業'),
			 ('2497','怡利電','上市','汽車工業'),
			 ('2498','宏達電','上市','通信網路業'),
			 ('2501','國建','上市','建材營造業'),
			 ('2504','國產','上市','建材營造業'),
			 ('2505','國揚','上市','建材營造業'),
			 ('2506','太設','上市','建材營造業'),
			 ('2509','全坤建','上市','建材營造業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('2511','太子','上市','建材營造業'),
			 ('2514','龍邦','上市','其他業'),
			 ('2515','中工','上市','建材營造業'),
			 ('2516','新建','上市','建材營造業'),
			 ('2520','冠德','上市','建材營造業'),
			 ('2524','京城','上市','建材營造業'),
			 ('2527','宏璟','上市','建材營造業'),
			 ('2528','皇普','上市','建材營造業'),
			 ('2530','華建','上市','建材營造業'),
			 ('2534','宏盛','上市','建材營造業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('2535','達欣工','上市','建材營造業'),
			 ('2536','宏普','上市','建材營造業'),
			 ('2537','聯上發','上市','建材營造業'),
			 ('2538','基泰','上市','建材營造業'),
			 ('2539','櫻花建','上市','建材營造業'),
			 ('2540','愛山林','上市','建材營造業'),
			 ('2542','興富發','上市','建材營造業'),
			 ('2543','皇昌','上市','建材營造業'),
			 ('2545','皇翔','上市','建材營造業'),
			 ('2546','根基','上市','建材營造業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('2547','日勝生','上市','建材營造業'),
			 ('2548','華固','上市','建材營造業'),
			 ('2597','潤弘','上市','建材營造業'),
			 ('2601','益航','上市','貿易百貨業'),
			 ('2603','長榮','上市','航運業'),
			 ('2605','新興','上市','航運業'),
			 ('2606','裕民','上市','航運業'),
			 ('2607','榮運','上市','航運業'),
			 ('2608','嘉里大榮','上市','航運業'),
			 ('2609','陽明','上市','航運業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('2610','華航','上市','航運業'),
			 ('2611','志信','上市','航運業'),
			 ('2612','中航','上市','航運業'),
			 ('2613','中櫃','上市','航運業'),
			 ('2614','東森','上市','其他業'),
			 ('2615','萬海','上市','航運業'),
			 ('2616','山隆','上市','油電燃氣業'),
			 ('2617','台航','上市','航運業'),
			 ('2618','長榮航','上市','航運業'),
			 ('2630','亞航','上市','航運業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('2633','台灣高鐵','上市','航運業'),
			 ('2634','漢翔','上市','航運業'),
			 ('2636','台驊投控','上市','航運業'),
			 ('2637','慧洋-KY','上市','航運業'),
			 ('2642','宅配通','上市','航運業'),
			 ('2645','長榮航太','上市','航運業'),
			 ('2701','萬企','上市','觀光餐旅'),
			 ('2702','華園','上市','觀光餐旅'),
			 ('2704','國賓','上市','觀光餐旅'),
			 ('2705','六福','上市','觀光餐旅');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('2706','第一店','上市','觀光餐旅'),
			 ('2707','晶華','上市','觀光餐旅'),
			 ('2712','遠雄來','上市','觀光餐旅'),
			 ('2722','夏都','上市','觀光餐旅'),
			 ('2723','美食-KY','上市','觀光餐旅'),
			 ('2727','王品','上市','觀光餐旅'),
			 ('2731','雄獅','上市','觀光餐旅'),
			 ('2739','寒舍','上市','觀光餐旅'),
			 ('2748','雲品','上市','觀光餐旅'),
			 ('2753','八方雲集','上市','觀光餐旅');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('2801','彰銀','上市','金融保險業'),
			 ('2809','京城銀','上市','金融保險業'),
			 ('2812','台中銀','上市','金融保險業'),
			 ('2816','旺旺保','上市','金融保險業'),
			 ('2820','華票','上市','金融保險業'),
			 ('2832','台產','上市','金融保險業'),
			 ('2834','臺企銀','上市','金融保險業'),
			 ('2836','高雄銀','上市','金融保險業'),
			 ('2838','聯邦銀','上市','金融保險業'),
			 ('2845','遠東銀','上市','金融保險業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('2849','安泰銀','上市','金融保險業'),
			 ('2850','新產','上市','金融保險業'),
			 ('2851','中再保','上市','金融保險業'),
			 ('2852','第一保','上市','金融保險業'),
			 ('2855','統一證','上市','金融保險業'),
			 ('2867','三商壽','上市','金融保險業'),
			 ('2880','華南金','上市','金融保險業'),
			 ('2881','富邦金','上市','金融保險業'),
			 ('2882','國泰金','上市','金融保險業'),
			 ('2883','開發金','上市','金融保險業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('2884','玉山金','上市','金融保險業'),
			 ('2885','元大金','上市','金融保險業'),
			 ('2886','兆豐金','上市','金融保險業'),
			 ('2887','台新金','上市','金融保險業'),
			 ('2888','新光金','上市','金融保險業'),
			 ('2889','國票金','上市','金融保險業'),
			 ('2890','永豐金','上市','金融保險業'),
			 ('2891','中信金','上市','金融保險業'),
			 ('2892','第一金','上市','金融保險業'),
			 ('2897','王道銀行','上市','金融保險業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('2901','欣欣','上市','貿易百貨業'),
			 ('2903','遠百','上市','貿易百貨業'),
			 ('2904','匯僑','上市','其他業'),
			 ('2905','三商','上市','貿易百貨業'),
			 ('2906','高林','上市','貿易百貨業'),
			 ('2908','特力','上市','貿易百貨業'),
			 ('2910','統領','上市','貿易百貨業'),
			 ('2911','麗嬰房','上市','貿易百貨業'),
			 ('2912','統一超','上市','貿易百貨業'),
			 ('2913','農林','上市','貿易百貨業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('2915','潤泰全','上市','貿易百貨業'),
			 ('2923','鼎固-KY','上市','建材營造業'),
			 ('2929','淘帝-KY','上市','貿易百貨業'),
			 ('2939','凱羿-KY','上市','貿易百貨業'),
			 ('2945','三商家購','上市','貿易百貨業'),
			 ('3002','歐格','上市','電腦及週邊設備業'),
			 ('3003','健和興','上市','電子零組件業'),
			 ('3004','豐達科','上市','鋼鐵工業'),
			 ('3005','神基','上市','電腦及週邊設備業'),
			 ('3006','晶豪科','上市','半導體業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('3008','大立光','上市','光電業'),
			 ('3010','華立','上市','電子通路業'),
			 ('3011','今皓','上市','電子零組件業'),
			 ('3013','晟銘電','上市','電腦及週邊設備業'),
			 ('3014','聯陽','上市','半導體業'),
			 ('3015','全漢','上市','電子零組件業'),
			 ('3016','嘉晶','上市','半導體業'),
			 ('3017','奇鋐','上市','電腦及週邊設備業'),
			 ('3018','隆銘綠能','上市','其他電子業'),
			 ('3019','亞光','上市','光電業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('3021','鴻名','上市','電子零組件業'),
			 ('3022','威強電','上市','電腦及週邊設備業'),
			 ('3023','信邦','上市','電子零組件業'),
			 ('3024','憶聲','上市','光電業'),
			 ('3025','星通','上市','通信網路業'),
			 ('3026','禾伸堂','上市','電子零組件業'),
			 ('3027','盛達','上市','通信網路業'),
			 ('3028','增你強','上市','電子通路業'),
			 ('3029','零壹','上市','資訊服務業'),
			 ('3030','德律','上市','其他電子業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('3031','佰鴻','上市','光電業'),
			 ('3032','偉訓','上市','電子零組件業'),
			 ('3033','威健','上市','電子通路業'),
			 ('3034','聯詠','上市','半導體業'),
			 ('3035','智原','上市','半導體業'),
			 ('3036','文曄','上市','電子通路業'),
			 ('3037','欣興','上市','電子零組件業'),
			 ('3038','全台','上市','光電業'),
			 ('3040','遠見','上市','其他業'),
			 ('3041','揚智','上市','半導體業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('3042','晶技','上市','電子零組件業'),
			 ('3043','科風','上市','其他電子業'),
			 ('3044','健鼎','上市','電子零組件業'),
			 ('3045','台灣大','上市','通信網路業'),
			 ('3046','建碁','上市','電腦及週邊設備業'),
			 ('3047','訊舟','上市','通信網路業'),
			 ('3048','益登','上市','電子通路業'),
			 ('3049','和鑫','上市','光電業'),
			 ('3050','鈺德','上市','光電業'),
			 ('3051','力特','上市','光電業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('3052','夆典','上市','建材營造業'),
			 ('3054','立萬利','上市','半導體業'),
			 ('3055','蔚華科','上市','電子通路業'),
			 ('3056','總太','上市','建材營造業'),
			 ('3057','喬鼎','上市','電腦及週邊設備業'),
			 ('3058','立德','上市','電子零組件業'),
			 ('3059','華晶科','上市','光電業'),
			 ('3060','銘異','上市','電腦及週邊設備業'),
			 ('3062','建漢','上市','通信網路業'),
			 ('3090','日電貿','上市','電子零組件業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('3092','鴻碩','上市','電子零組件業'),
			 ('3094','聯傑','上市','半導體業'),
			 ('3130','一零四','上市','資訊服務業'),
			 ('3138','耀登','上市','通信網路業'),
			 ('3149','正達','上市','光電業'),
			 ('3164','景岳','上市','生技醫療業'),
			 ('3167','大量','上市','電機機械'),
			 ('3189','景碩','上市','半導體業'),
			 ('3209','全科','上市','電子通路業'),
			 ('3229','晟鈦','上市','電子零組件業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('3231','緯創','上市','電腦及週邊設備業'),
			 ('3257','虹冠電','上市','半導體業'),
			 ('3266','昇陽','上市','建材營造業'),
			 ('3296','勝德','上市','電子零組件業'),
			 ('3305','昇貿','上市','其他電子業'),
			 ('3308','聯德','上市','電子零組件業'),
			 ('3311','閎暉','上市','通信網路業'),
			 ('3312','弘憶股','上市','電子通路業'),
			 ('3321','同泰','上市','電子零組件業'),
			 ('3338','泰碩','上市','電子零組件業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('3346','麗清','上市','汽車工業'),
			 ('3356','奇偶','上市','光電業'),
			 ('3376','新日興','上市','電子零組件業'),
			 ('3380','明泰','上市','通信網路業'),
			 ('3406','玉晶光','上市','光電業'),
			 ('3413','京鼎','上市','半導體業'),
			 ('3416','融程電','上市','電腦及週邊設備業'),
			 ('3419','譁裕','上市','通信網路業'),
			 ('3432','台端','上市','電子零組件業'),
			 ('3437','榮創','上市','光電業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('3443','創意','上市','半導體業'),
			 ('3447','展達','上市','通信網路業'),
			 ('3450','聯鈞','上市','半導體業'),
			 ('3454','晶睿','上市','光電業'),
			 ('3481','群創','上市','光電業'),
			 ('3494','誠研','上市','電腦及週邊設備業'),
			 ('3501','維熹','上市','電子零組件業'),
			 ('3504','揚明光','上市','光電業'),
			 ('3515','華擎','上市','電腦及週邊設備業'),
			 ('3518','柏騰','上市','其他電子業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('3528','安馳','上市','電子通路業'),
			 ('3530','晶相光','上市','半導體業'),
			 ('3532','台勝科','上市','半導體業'),
			 ('3533','嘉澤','上市','電子零組件業'),
			 ('3535','晶彩科','上市','光電業'),
			 ('3536','誠創','上市','半導體業'),
			 ('3543','州巧','上市','光電業'),
			 ('3545','敦泰','上市','半導體業'),
			 ('3550','聯穎','上市','電子零組件業'),
			 ('3557','嘉威','上市','其他業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('3563','牧德','上市','光電業'),
			 ('3576','聯合再生','上市','光電業'),
			 ('3583','辛耘','上市','半導體業'),
			 ('3588','通嘉','上市','半導體業'),
			 ('3591','艾笛森','上市','光電業'),
			 ('3592','瑞鼎','上市','半導體業'),
			 ('3593','力銘','上市','電子零組件業'),
			 ('3596','智易','上市','通信網路業'),
			 ('3605','宏致','上市','電子零組件業'),
			 ('3607','谷崧','上市','電子零組件業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('3617','碩天','上市','其他電子業'),
			 ('3622','洋華','上市','光電業'),
			 ('3645','達邁','上市','電子零組件業'),
			 ('3652','精聯','上市','電腦及週邊設備業'),
			 ('3653','健策','上市','電子零組件業'),
			 ('3661','世芯-KY','上市','半導體業'),
			 ('3665','貿聯-KY','上市','其他電子業'),
			 ('3669','圓展','上市','通信網路業'),
			 ('3673','TPK-KY','上市','光電業'),
			 ('3679','新至陞','上市','電子零組件業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('3682','亞太電','上市','通信網路業'),
			 ('3686','達能','上市','半導體業'),
			 ('3694','海華','上市','通信網路業'),
			 ('3701','大眾控','上市','電腦及週邊設備業'),
			 ('3702','大聯大','上市','電子通路業'),
			 ('3703','欣陸','上市','建材營造業'),
			 ('3704','合勤控','上市','通信網路業'),
			 ('3705','永信','上市','生技醫療業'),
			 ('3706','神達','上市','電腦及週邊設備業'),
			 ('3708','上緯投控','上市','化學工業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('3711','日月光投控','上市','半導體業'),
			 ('3712','永崴投控','上市','電腦及週邊設備業'),
			 ('3714','富采','上市','光電業'),
			 ('3715','定穎投控','上市','電子零組件業'),
			 ('4104','佳醫','上市','生技醫療業'),
			 ('4106','雃博','上市','生技醫療業'),
			 ('4108','懷特','上市','生技醫療業'),
			 ('4119','旭富','上市','生技醫療業'),
			 ('4133','亞諾法','上市','生技醫療業'),
			 ('4137','麗豐-KY','上市','生技醫療業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('4142','國光生','上市','生技醫療業'),
			 ('4155','訊映','上市','生技醫療業'),
			 ('4164','承業醫','上市','生技醫療業'),
			 ('4190','佐登-KY','上市','生技醫療業'),
			 ('4306','炎洲','上市','塑膠工業'),
			 ('4414','如興','上市','紡織纖維'),
			 ('4426','利勤','上市','紡織纖維'),
			 ('4438','廣越','上市','紡織纖維'),
			 ('4439','冠星-KY','上市','紡織纖維'),
			 ('4440','宜新實業','上市','紡織纖維');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('4526','東台','上市','電機機械'),
			 ('4532','瑞智','上市','電機機械'),
			 ('4536','拓凱','上市','其他業'),
			 ('4540','全球傳動','上市','電機機械'),
			 ('4545','銘鈺','上市','電子零組件業'),
			 ('4551','智伸科','上市','汽車工業'),
			 ('4552','力達-KY','上市','電機機械'),
			 ('4555','氣立','上市','電機機械'),
			 ('4557','永新-KY','上市','汽車工業'),
			 ('4560','強信-KY','上市','電機機械');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('4562','穎漢','上市','電機機械'),
			 ('4564','元翎','上市','電機機械'),
			 ('4566','時碩工業','上市','電機機械'),
			 ('4571','鈞興-KY','上市','電機機械'),
			 ('4572','駐龍','上市','電機機械'),
			 ('4576','大銀微系統','上市','電機機械'),
			 ('4581','光隆精密-KY','上市','汽車工業'),
			 ('4583','台灣精銳','上市','電機機械'),
			 ('4720','德淵','上市','化學工業'),
			 ('4722','國精化','上市','化學工業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('4737','華廣','上市','生技醫療業'),
			 ('4739','康普','上市','化學工業'),
			 ('4746','台耀','上市','生技醫療業'),
			 ('4755','三福化','上市','化學工業'),
			 ('4763','材料-KY','上市','化學工業'),
			 ('4764','雙鍵','上市','化學工業'),
			 ('4766','南寶','上市','化學工業'),
			 ('4770','上品','上市','化學工業'),
			 ('4807','日成-KY','上市','貿易百貨業'),
			 ('4904','遠傳','上市','通信網路業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('4906','正文','上市','通信網路業'),
			 ('4912','聯德控股-KY','上市','電子零組件業'),
			 ('4915','致伸','上市','電子零組件業'),
			 ('4916','事欣科','上市','電腦及週邊設備業'),
			 ('4919','新唐','上市','半導體業'),
			 ('4927','泰鼎-KY','上市','電子零組件業'),
			 ('4930','燦星網','上市','電器電纜'),
			 ('4934','太極','上市','光電業'),
			 ('4935','茂林-KY','上市','光電業'),
			 ('4938','和碩','上市','電腦及週邊設備業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('4942','嘉彰','上市','光電業'),
			 ('4943','康控-KY','上市','電子零組件業'),
			 ('4952','凌通','上市','半導體業'),
			 ('4956','光鋐','上市','光電業'),
			 ('4958','臻鼎-KY','上市','電子零組件業'),
			 ('4960','誠美材','上市','光電業'),
			 ('4961','天鈺','上市','半導體業'),
			 ('4967','十銓','上市','半導體業'),
			 ('4968','立積','上市','半導體業'),
			 ('4976','佳凌','上市','光電業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('4977','眾達-KY','上市','通信網路業'),
			 ('4989','榮科','上市','電子零組件業'),
			 ('4994','傳奇','上市','資訊服務業'),
			 ('4999','鑫禾','上市','電子零組件業'),
			 ('5007','三星','上市','鋼鐵工業'),
			 ('5203','訊連','上市','資訊服務業'),
			 ('5215','科嘉-KY','上市','電腦及週邊設備業'),
			 ('5222','全訊','上市','半導體業'),
			 ('5225','東科-KY','上市','其他電子業'),
			 ('5234','達興材料','上市','光電業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('5243','乙盛-KY','上市','光電業'),
			 ('5244','弘凱','上市','光電業'),
			 ('5258','虹堡','上市','電腦及週邊設備業'),
			 ('5269','祥碩','上市','半導體業'),
			 ('5283','禾聯碩','上市','電器電纜'),
			 ('5284','jpp-KY','上市','其他業'),
			 ('5285','界霖','上市','半導體業'),
			 ('5288','豐祥-KY','上市','電機機械'),
			 ('5306','桂盟','上市','其他業'),
			 ('5388','中磊','上市','通信網路業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('5434','崇越','上市','電子通路業'),
			 ('5469','瀚宇博','上市','電子零組件業'),
			 ('5471','松翰','上市','半導體業'),
			 ('5484','慧友','上市','光電業'),
			 ('5515','建國','上市','建材營造業'),
			 ('5519','隆大','上市','建材營造業'),
			 ('5521','工信','上市','建材營造業'),
			 ('5522','遠雄','上市','建材營造業'),
			 ('5525','順天','上市','建材營造業'),
			 ('5531','鄉林','上市','建材營造業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('5533','皇鼎','上市','建材營造業'),
			 ('5534','長虹','上市','建材營造業'),
			 ('5538','東明-KY','上市','鋼鐵工業'),
			 ('5546','永固-KY','上市','建材營造業'),
			 ('5607','遠雄港','上市','航運業'),
			 ('5608','四維航','上市','航運業'),
			 ('5706','鳳凰','上市','觀光餐旅'),
			 ('5871','中租-KY','上市','其他業'),
			 ('5876','上海商銀','上市','金融保險業'),
			 ('5880','合庫金','上市','金融保險業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('5906','台南-KY','上市','貿易百貨業'),
			 ('5907','大洋-KY','上市','貿易百貨業'),
			 ('6005','群益證','上市','金融保險業'),
			 ('6024','群益期','上市','金融保險業'),
			 ('6108','競國','上市','電子零組件業'),
			 ('6112','邁達特','上市','資訊服務業'),
			 ('6115','鎰勝','上市','電子零組件業'),
			 ('6116','彩晶','上市','光電業'),
			 ('6117','迎廣','上市','電腦及週邊設備業'),
			 ('6120','達運','上市','光電業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('6128','上福','上市','電腦及週邊設備業'),
			 ('6133','金橋','上市','電子零組件業'),
			 ('6136','富爾特','上市','通信網路業'),
			 ('6139','亞翔','上市','其他電子業'),
			 ('6141','柏承','上市','電子零組件業'),
			 ('6142','友勁','上市','通信網路業'),
			 ('6152','百一','上市','通信網路業'),
			 ('6153','嘉聯益','上市','電子零組件業'),
			 ('6155','鈞寶','上市','電子零組件業'),
			 ('6164','華興','上市','光電業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('6165','浪凡','上市','其他業'),
			 ('6166','凌華','上市','電腦及週邊設備業'),
			 ('6168','宏齊','上市','光電業'),
			 ('6176','瑞儀','上市','光電業'),
			 ('6177','達麗','上市','建材營造業'),
			 ('6183','關貿','上市','資訊服務業'),
			 ('6184','大豐電','上市','其他業'),
			 ('6189','豐藝','上市','電子通路業'),
			 ('6191','精成科','上市','電子零組件業'),
			 ('6192','巨路','上市','其他電子業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('6196','帆宣','上市','其他電子業'),
			 ('6197','佳必琪','上市','電子零組件業'),
			 ('6201','亞弘電','上市','其他電子業'),
			 ('6202','盛群','上市','半導體業'),
			 ('6205','詮欣','上市','電子零組件業'),
			 ('6206','飛捷','上市','電腦及週邊設備業'),
			 ('6209','今國光','上市','光電業'),
			 ('6213','聯茂','上市','電子零組件業'),
			 ('6214','精誠','上市','資訊服務業'),
			 ('6215','和椿','上市','其他電子業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('6216','居易','上市','通信網路業'),
			 ('6224','聚鼎','上市','電子零組件業'),
			 ('6225','天瀚','上市','光電業'),
			 ('6226','光鼎','上市','光電業'),
			 ('6230','尼得科超眾','上市','電腦及週邊設備業'),
			 ('6235','華孚','上市','電腦及週邊設備業'),
			 ('6239','力成','上市','半導體業'),
			 ('6243','迅杰','上市','半導體業'),
			 ('6257','矽格','上市','半導體業'),
			 ('6269','台郡','上市','電子零組件業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('6271','同欣電','上市','半導體業'),
			 ('6277','宏正','上市','電腦及週邊設備業'),
			 ('6278','台表科','上市','光電業'),
			 ('6281','全國電','上市','電子通路業'),
			 ('6282','康舒','上市','電子零組件業'),
			 ('6283','淳安','上市','其他電子業'),
			 ('6285','啟碁','上市','通信網路業'),
			 ('6288','聯嘉','上市','汽車工業'),
			 ('6405','悅城','上市','光電業'),
			 ('6409','旭隼','上市','其他電子業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('6412','群電','上市','電子零組件業'),
			 ('6414','樺漢','上市','電腦及週邊設備業'),
			 ('6415','矽力*-KY','上市','半導體業'),
			 ('6416','瑞祺電通','上市','通信網路業'),
			 ('6426','統新','上市','通信網路業'),
			 ('6431','光麗-KY','上市','生技醫療業'),
			 ('6438','迅得','上市','其他電子業'),
			 ('6442','光聖','上市','通信網路業'),
			 ('6443','元晶','上市','光電業'),
			 ('6449','鈺邦','上市','電子零組件業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('6451','訊芯-KY','上市','半導體業'),
			 ('6456','GIS-KY','上市','光電業'),
			 ('6464','台數科','上市','其他業'),
			 ('6477','安集','上市','光電業'),
			 ('6491','晶碩','上市','生技醫療業'),
			 ('6504','南六','上市','其他業'),
			 ('6505','台塑化','上市','油電燃氣業'),
			 ('6515','穎崴','上市','半導體業'),
			 ('6525','捷敏-KY','上市','半導體業'),
			 ('6531','愛普*','上市','半導體業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('6533','晶心科','上市','半導體業'),
			 ('6541','泰福-KY','上市','生技醫療業'),
			 ('6550','北極星藥業-KY','上市','生技醫療業'),
			 ('6552','易華電','上市','半導體業'),
			 ('6558','興能高','上市','其他電子業'),
			 ('6573','虹揚-KY','上市','半導體業'),
			 ('6579','研揚','上市','電腦及週邊設備業'),
			 ('6581','鋼聯','上市','其他業'),
			 ('6582','申豐','上市','橡膠工業'),
			 ('6585','鼎基','上市','其他業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('6591','動力-KY','上市','電腦及週邊設備業'),
			 ('6592','和潤企業','上市','其他業'),
			 ('6598','ABC-KY','上市','生技醫療業'),
			 ('6605','帝寶','上市','汽車工業'),
			 ('6606','建德工業','上市','電機機械'),
			 ('6625','必應','上市','其他業'),
			 ('6641','基士德-KY','上市','其他業'),
			 ('6655','科定','上市','其他業'),
			 ('6666','羅麗芬-KY','上市','生技醫療業'),
			 ('6668','中揚光','上市','光電業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('6669','緯穎','上市','電腦及週邊設備業'),
			 ('6670','復盛應用','上市','其他業'),
			 ('6671','三能-KY','上市','其他業'),
			 ('6672','騰輝電子-KY','上市','電子零組件業'),
			 ('6674','鋐寶科技','上市','通信網路業'),
			 ('6689','伊雲谷','上市','其他電子業'),
			 ('6691','洋基工程','上市','其他電子業'),
			 ('6695','芯鼎','上市','半導體業'),
			 ('6698','旭暉應材','上市','其他電子業'),
			 ('6706','惠特','上市','光電業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('6715','嘉基','上市','電子零組件業'),
			 ('6719','力智','上市','半導體業'),
			 ('6743','安普新','上市','其他電子業'),
			 ('6753','龍德造船','上市','航運業'),
			 ('6754','匯僑設計','上市','其他業'),
			 ('6756','威鋒電子','上市','半導體業'),
			 ('6768','志強-KY','上市','其他業'),
			 ('6770','力積電','上市','半導體業'),
			 ('6776','展碁國際','上市','電子通路業'),
			 ('6781','AES-KY','上市','電子零組件業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('6782','視陽','上市','生技醫療業'),
			 ('6789','采鈺','上市','半導體業'),
			 ('6790','永豐實','上市','造紙工業'),
			 ('6792','詠業','上市','通信網路業'),
			 ('6796','晉弘','上市','生技醫療業'),
			 ('6799','來頡','上市','半導體業'),
			 ('6806','森崴能源','上市','其他業'),
			 ('6807','峰源-KY','上市','其他業'),
			 ('6830','汎銓','上市','其他電子業'),
			 ('6834','天二科技','上市','電子零組件業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('6835','圓裕','上市','電子零組件業'),
			 ('6861','睿生光電','上市','生技醫療業'),
			 ('6863','永道-KY','上市','通信網路業'),
			 ('8011','台通','上市','通信網路業'),
			 ('8016','矽創','上市','半導體業'),
			 ('8021','尖點','上市','其他電子業'),
			 ('8028','昇陽半導體','上市','半導體業'),
			 ('8033','雷虎','上市','其他業'),
			 ('8039','台虹','上市','電子零組件業'),
			 ('8046','南電','上市','電子零組件業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('8070','長華*','上市','電子通路業'),
			 ('8072','陞泰','上市','電子通路業'),
			 ('8081','致新','上市','半導體業'),
			 ('8101','華冠','上市','通信網路業'),
			 ('8103','瀚荃','上市','電子零組件業'),
			 ('8104','錸寶','上市','光電業'),
			 ('8105','凌巨','上市','光電業'),
			 ('8110','華東','上市','半導體業'),
			 ('8112','至上','上市','電子通路業'),
			 ('8114','振樺電','上市','電腦及週邊設備業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('8131','福懋科','上市','半導體業'),
			 ('8150','南茂','上市','半導體業'),
			 ('8163','達方','上市','電腦及週邊設備業'),
			 ('8201','無敵','上市','其他電子業'),
			 ('8210','勤誠','上市','電腦及週邊設備業'),
			 ('8213','志超','上市','電子零組件業'),
			 ('8215','明基材','上市','光電業'),
			 ('8222','寶一','上市','電機機械'),
			 ('8249','菱光','上市','電子零組件業'),
			 ('8261','富鼎','上市','半導體業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('8271','宇瞻','上市','半導體業'),
			 ('8341','日友','上市','其他業'),
			 ('8367','建新國際','上市','航運業'),
			 ('8374','羅昇','上市','電機機械'),
			 ('8404','百和興業-KY','上市','其他業'),
			 ('8411','福貞-KY','上市','其他業'),
			 ('8422','可寧衛','上市','其他業'),
			 ('8429','金麗-KY','上市','貿易百貨業'),
			 ('8438','昶昕','上市','其他業'),
			 ('8442','威宏-KY','上市','其他業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('8443','阿瘦','上市','貿易百貨業'),
			 ('8454','富邦媒','上市','貿易百貨業'),
			 ('8462','柏文','上市','觀光餐旅'),
			 ('8463','潤泰材','上市','其他業'),
			 ('8464','億豐','上市','其他業'),
			 ('8466','美吉吉-KY','上市','其他業'),
			 ('8467','波力-KY','上市','其他業'),
			 ('8473','山林水','上市','其他業'),
			 ('8478','東哥遊艇','上市','其他業'),
			 ('8481','政伸','上市','其他業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('8482','商億-KY','上市','其他業'),
			 ('8488','吉源-KY','上市','其他業'),
			 ('8499','鼎炫-KY','上市','其他電子業'),
			 ('8926','台汽電','上市','油電燃氣業'),
			 ('8940','新天地','上市','觀光餐旅'),
			 ('8996','高力','上市','電機機械'),
			 ('9802','鈺齊-KY','上市','其他業'),
			 ('9902','台火','上市','其他業'),
			 ('9904','寶成','上市','其他業'),
			 ('9905','大華','上市','其他業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('9906','欣巴巴','上市','建材營造業'),
			 ('9907','統一實','上市','其他業'),
			 ('9908','大台北','上市','油電燃氣業'),
			 ('9910','豐泰','上市','其他業'),
			 ('9911','櫻花','上市','其他業'),
			 ('9912','偉聯','上市','電腦及週邊設備業'),
			 ('9914','美利達','上市','其他業'),
			 ('9917','中保科','上市','其他業'),
			 ('9918','欣天然','上市','油電燃氣業'),
			 ('9919','康那香','上市','其他業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('9921','巨大','上市','其他業'),
			 ('9924','福興','上市','其他業'),
			 ('9925','新保','上市','其他業'),
			 ('9926','新海','上市','油電燃氣業'),
			 ('9927','泰銘','上市','其他業'),
			 ('9928','中視','上市','其他業'),
			 ('9929','秋雨','上市','其他業'),
			 ('9930','中聯資源','上市','其他業'),
			 ('9931','欣高','上市','油電燃氣業'),
			 ('9933','中鼎','上市','其他業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('9934','成霖','上市','其他業'),
			 ('9935','慶豐富','上市','其他業'),
			 ('9937','全國','上市','油電燃氣業'),
			 ('9938','百和','上市','其他業'),
			 ('9939','宏全','上市','其他業'),
			 ('9940','信義','上市','其他業'),
			 ('9941','裕融','上市','其他業'),
			 ('9942','茂順','上市','其他業'),
			 ('9943','好樂迪','上市','觀光餐旅'),
			 ('9944','新麗','上市','其他業');
		INSERT INTO stock.stock_list (id,sname,stock_attr,industry) VALUES
			 ('9945','潤泰新','上市','其他業'),
			 ('9946','三發地產','上市','建材營造業'),
			 ('9955','佳龍','上市','其他業'),
			 ('9958','世紀鋼','上市','鋼鐵工業');
		
	   -- 如果總表存在先行移除，避免資料重複
	   SET @drop_table=CONCAT("DROP TABLE IF EXISTS stock_all_data");
       PREPARE stmt2 FROM @drop_table;                                                                                                                                               
	   EXECUTE stmt2; 
        
        OPEN cur;                                                                                                                                                               
		
        -- 迴圈開始
        tables_loop: LOOP                   
            	
			-- 將資料集透過迴圈取出，最後一張表時強制離開迴圈
            FETCH cur INTO table_name;             			
            IF end_of_tables = 1 THEN                                                                                                                                           
                LEAVE tables_loop;                                                                                                                                              
            END IF;                                                                                                                                                             
			
            -- 使用CONCAT串接SQL語法(這一段是查看SQL結果，可以拿掉不執行)
             -- SET @show_schema = CONCAT("desc"," ",DBName,".",table_name);
            -- 建立PREPARE STATEMENT，並執行
            --  PREPARE stmt FROM @show_schema;                                                                                                                                               
            -- EXECUTE stmt;     
     
            -- 判斷不同的資料表，給予不同的中文欄位名稱
			CASE table_name
			WHEN 'stock_list' THEN
			   SET @table_type='證券清冊';
			   SET @caseSQL = CONCAT("(
						CASE 
							WHEN COLUMN_NAME='id' THEN '證券代號'
                            WHEN COLUMN_NAME='sname' THEN '證券名稱' 
                            WHEN COLUMN_NAME='stock_attr' THEN '上市上櫃類別'
                            WHEN COLUMN_NAME='industry' THEN '產業分類'
						ELSE 'null'
						END)  as descs"
						);
                        
			WHEN  'stock_daily' THEN
			   SET @table_type='每日收盤資訊';
			   SET @caseSQL=CONCAT("(
						CASE 
							WHEN COLUMN_NAME='sdate' THEN '交易日期' 
							WHEN COLUMN_NAME='id' THEN '證券代號'
                            WHEN COLUMN_NAME='sname' THEN '證券名稱'
                            WHEN COLUMN_NAME='trs_qty' THEN '成交股數'
                            WHEN COLUMN_NAME='trs_count' THEN '成交筆數'
                            WHEN COLUMN_NAME='trs_amt' THEN '成交金額'
                            WHEN COLUMN_NAME='open_price' THEN '開盤價'
                            WHEN COLUMN_NAME='h_price' THEN '最高價'
                            WHEN COLUMN_NAME='l_price' THEN '最低價'
                            WHEN COLUMN_NAME='close_price' THEN '收盤價'
                            WHEN COLUMN_NAME='s_status' THEN '漲跌(+/-)'
                            WHEN COLUMN_NAME='dec_price' THEN '漲跌價差'
                            WHEN COLUMN_NAME='lb_price' THEN '最後揭示買價'
                            WHEN COLUMN_NAME='lb_amt' THEN '最後揭示買量'
                            WHEN COLUMN_NAME='ls_price' THEN '最後揭示賣價'
                            WHEN COLUMN_NAME='ls_amt' THEN '最後揭示賣量'
                            WHEN COLUMN_NAME='PE' THEN '本益比'
						ELSE 'null'
						END)  as descs"
						);
                        
			   WHEN 'stock_monthly_revenue' THEN
			    SET @table_type='每月營收';
			   SET @caseSQL = CONCAT("(
						CASE 
							WHEN COLUMN_NAME='yyyymm' THEN '營收年月' 
							WHEN COLUMN_NAME='id' THEN '證券代號'
                            WHEN COLUMN_NAME='sname' THEN '證券名稱'
                            WHEN COLUMN_NAME='month_amt' THEN '當月營收'
                            WHEN COLUMN_NAME='pre_m_amt' THEN '上月營收'
                            WHEN COLUMN_NAME='pre_y_amt' THEN '去年當月營收'
                            WHEN COLUMN_NAME='pre_m_percent' THEN '上月比較增減(%)'
                            WHEN COLUMN_NAME='pre_y_percent' THEN '去年同月增減(%)'
                            WHEN COLUMN_NAME='sum_amt' THEN '當月累計營收'
                            WHEN COLUMN_NAME='per_sum_amt' THEN '去年累計營收'
                            WHEN COLUMN_NAME='sum_percent' THEN '前期比較增減(%)'
                            WHEN COLUMN_NAME='memo_str' THEN '備註'
						ELSE 'null'
						END)  as descs"
						);
                        
			WHEN 'stock_daily_3' THEN
               SET @table_type='三大法人進出';
			   SET @caseSQL = CONCAT("(
						CASE 
							WHEN COLUMN_NAME='sdate' THEN '交易日期' 
							WHEN COLUMN_NAME='id' THEN '證券代號'
                            WHEN COLUMN_NAME='f_qty' THEN '外資'
                            WHEN COLUMN_NAME='i_qty' THEN '投信'
                            WHEN COLUMN_NAME='s_qty' THEN '自營商'
                            WHEN COLUMN_NAME='t_qty' THEN '單日合計'
                            WHEN COLUMN_NAME='est_f_qty' THEN '估計外資持股'
                            WHEN COLUMN_NAME='est_i_qty' THEN '估計投信持股'
                            WHEN COLUMN_NAME='est_s_qty' THEN '估計自營商持股'
                            WHEN COLUMN_NAME='est_t_qty' THEN '合計'
                            WHEN COLUMN_NAME='trs_f_percent' THEN '外資比例'
                            WHEN COLUMN_NAME='trs_3_percent' THEN '三大法人比例'
						ELSE 'null'
						END) as descs"
						);
			WHEN 'stock_daily_mr' THEN
               SET @table_type='主力進出';
			   SET @caseSQL = CONCAT("(
						CASE 
							WHEN COLUMN_NAME='sdate' THEN '日期' 
							WHEN COLUMN_NAME='id' THEN '股票代號'
                            WHEN COLUMN_NAME='id_sub' THEN '券商代號'
                            WHEN COLUMN_NAME='id_mr' THEN '券商主代號'
                            WHEN COLUMN_NAME='mrname' THEN '券商名稱'
                            WHEN COLUMN_NAME='b_qty' THEN '買進'
                            WHEN COLUMN_NAME='s_qty' THEN '賣出'
                            WHEN COLUMN_NAME='dec_qty' THEN '買超'
                            WHEN COLUMN_NAME='dstatus' THEN '買or賣'
                            WHEN COLUMN_NAME='trs_percent' THEN '佔成交比重'
						ELSE 'null'
						END)  as descs"
						);
			WHEN 'stock_daily_mt' THEN
               SET @table_type='融資融券';
			   SET @caseSQL = CONCAT("(
						CASE 
							WHEN COLUMN_NAME='sdate' THEN '交易日期' 
							WHEN COLUMN_NAME='id' THEN '證券代號'
                            WHEN COLUMN_NAME='mt_b_qty' THEN '融資買進'
                            WHEN COLUMN_NAME='mt_s_qty' THEN '融資賣出'
                            WHEN COLUMN_NAME='mt_r_qty' THEN '融資現償'
                            WHEN COLUMN_NAME='mt_qty' THEN '融資餘額'
                            WHEN COLUMN_NAME='mt_dec_qty' THEN '融資增減'
                            WHEN COLUMN_NAME='mt_limit_qty' THEN '融資限額'
                            WHEN COLUMN_NAME='mt_use_percent' THEN '融資使用率'
                            WHEN COLUMN_NAME='ss_b_qty' THEN '融券賣出'
                            WHEN COLUMN_NAME='ss_s_qt' THEN '融券買進'
                            WHEN COLUMN_NAME='ss_r_qty' THEN '融券券償'
                            WHEN COLUMN_NAME='ss_qty' THEN '融券餘額'
                            WHEN COLUMN_NAME='ss_dec_qty' THEN '融券增減'
                            WHEN COLUMN_NAME='ms_percent' THEN '券資比'
                            WHEN COLUMN_NAME='ms_dec_qty' THEN '資券相抵'
						ELSE 'null'
						END)  as descs"
						);	

				ELSE BEGIN END;  
			END CASE;
            
				-- 建立總表資料表
				SET @create_table = CONCAT("CREATE TABLE IF NOT EXISTS stock_all_data(COLUMN_NAMES varchar(255),DATA_TYPE varchar(255),IS_NULLABLE varchar(255),COLUMN_KEY varchar(255),DESCS varchar(255),TABLE_TYPE varchar(255))");
                PREPARE stmt3 FROM @create_table;                                                                                                                                               
   			    EXECUTE stmt3; 
                
                -- 總表的資料來源是透過原先串好並取得的資料複製一份到stock_all_data
                SET @Insert_table = CONCAT("INSERT INTO stock_all_data (COLUMN_NAMES,DATA_TYPE,IS_NULLABLE,COLUMN_KEY,DESCS,TABLE_TYPE)");
				SET @join_table = CONCAT(@Insert_table,"select COLUMN_NAME,DATA_TYPE,IS_NULLABLE,COLUMN_KEY,",@caseSQL,",","'",@table_type,"'",' as TABLE_TYPE'" FROM information_schema.columns 
				where table_schema = '",DBName,"' AND table_name='",table_name,"'",";");  
                PREPARE stmt4 FROM @join_table;                                                                                                                                               
   			    EXECUTE stmt4; 
            
            -- 這一段供測試用
			-- SELECT @join_table;
         
         -- 迴圈結束
        END LOOP;                                                                                                                                                               
        CLOSE cur;                                                                                                                                                              
    END $$                                                                                                                                                                      
DELIMITER ;